; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v12 ?v8)
             (pred_10 ?v3 ?v9)
             (pred_1 ?v12 ?v9)
             (pred_11 ?v6 ?v12 )
	     (pred_8 ?v12)
             (pred_5 ?v1)
             (pred_3 ?v3)
             (pred_7 ?v9)
             (pred_4 ?v12)
             (pred_9 ?v3)
             (pred_12 ?v12)
             (pred_2 ))



(:action op_5
:parameters (?v5 ?v2 ?v11 ?v10)
:precondition (and (pred_5 ?v5) (pred_5 ?v2) (pred_3 ?v11) (pred_7 ?v10)
          (pred_6 ?v5 ?v2) (pred_10 ?v11 ?v10)
                   (pred_1 ?v2 ?v10) (pred_8 ?v5) 
                   (pred_4 ?v2) (pred_9 ?v11))
:effect (and  (pred_12 ?v2) (not (pred_4 ?v2))))


(:action op_4
:parameters (?v5 ?v4)
:precondition (and (pred_5 ?v5) (pred_5 ?v4)
               (pred_8 ?v5) (pred_6 ?v5 ?v4) (pred_12 ?v4))
:effect (and (pred_8 ?v4) (not (pred_8 ?v5))))

(:action op_2
:parameters (?v5 ?v11)
:precondition (and (pred_5 ?v5) (pred_3 ?v11) 
                  (pred_8 ?v5) (pred_11 ?v11 ?v5) (pred_2 ))
:effect (and (pred_9 ?v11)
   (not (pred_11 ?v11 ?v5)) (not (pred_2 ))))


(:action op_1
:parameters (?v5 ?v7 ?v13)
:precondition (and (pred_5 ?v5) (pred_3 ?v7) (pred_3 ?v13)
                  (pred_8 ?v5) (pred_9 ?v13) (pred_11 ?v7 ?v5))
:effect (and (pred_9 ?v7) (pred_11 ?v13 ?v5)
        (not (pred_9 ?v13)) (not (pred_11 ?v7 ?v5))))

(:action op_3
:parameters (?v5 ?v11)
:precondition (and (pred_5 ?v5) (pred_3 ?v11) 
                  (pred_8 ?v5) (pred_9 ?v11))
:effect (and (pred_2 ) (pred_11 ?v11 ?v5) (not (pred_9 ?v11)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_23 obj_28 obj_06 obj_24 obj_05 obj_30 obj_14 obj_20 obj_02 obj_17 obj_19 obj_01 obj_12 obj_09 obj_13 obj_29 obj_31 obj_25 obj_27 obj_18 obj_22 obj_15 obj_21 obj_08
    obj_07 obj_16 obj_10
    obj_26 obj_03 obj_11
    )

    (:init
       (pred_2)

       (pred_5 obj_04)
       (pred_5 obj_23)
       (pred_5 obj_28)
       (pred_5 obj_06)
       (pred_5 obj_24)
       (pred_5 obj_05)
       (pred_5 obj_30)
       (pred_5 obj_14)
       (pred_5 obj_20)
       (pred_5 obj_02)
       (pred_5 obj_17)
       (pred_5 obj_19)
       (pred_5 obj_01)
       (pred_5 obj_12)
       (pred_5 obj_09)
       (pred_5 obj_13)
       (pred_5 obj_29)
       (pred_5 obj_31)
       (pred_5 obj_25)
       (pred_5 obj_27)
       (pred_5 obj_18)
       (pred_5 obj_22)
       (pred_5 obj_15)
       (pred_5 obj_21)
       (pred_5 obj_08)
       (pred_7 obj_07)
       (pred_7 obj_16)
       (pred_7 obj_10)
       (pred_3 obj_26)
       (pred_3 obj_03)
       (pred_3 obj_11)

       (pred_6 obj_04 obj_05)
       (pred_6 obj_04 obj_23)
       (pred_6 obj_23 obj_30)
       (pred_6 obj_23 obj_28)
       (pred_6 obj_23 obj_04)
       (pred_6 obj_28 obj_14)
       (pred_6 obj_28 obj_06)
       (pred_6 obj_28 obj_23)
       (pred_6 obj_06 obj_20)
       (pred_6 obj_06 obj_24)
       (pred_6 obj_06 obj_28)
       (pred_6 obj_24 obj_02)
       (pred_6 obj_24 obj_06)
       (pred_6 obj_05 obj_17)
       (pred_6 obj_05 obj_30)
       (pred_6 obj_05 obj_04)
       (pred_6 obj_30 obj_19)
       (pred_6 obj_30 obj_14)
       (pred_6 obj_30 obj_23)
       (pred_6 obj_30 obj_05)
       (pred_6 obj_14 obj_01)
       (pred_6 obj_14 obj_20)
       (pred_6 obj_14 obj_28)
       (pred_6 obj_14 obj_30)
       (pred_6 obj_20 obj_12)
       (pred_6 obj_20 obj_02)
       (pred_6 obj_20 obj_06)
       (pred_6 obj_20 obj_14)
       (pred_6 obj_02 obj_09)
       (pred_6 obj_02 obj_24)
       (pred_6 obj_02 obj_20)
       (pred_6 obj_17 obj_13)
       (pred_6 obj_17 obj_19)
       (pred_6 obj_17 obj_05)
       (pred_6 obj_19 obj_29)
       (pred_6 obj_19 obj_01)
       (pred_6 obj_19 obj_30)
       (pred_6 obj_19 obj_17)
       (pred_6 obj_01 obj_31)
       (pred_6 obj_01 obj_12)
       (pred_6 obj_01 obj_14)
       (pred_6 obj_01 obj_19)
       (pred_6 obj_12 obj_25)
       (pred_6 obj_12 obj_09)
       (pred_6 obj_12 obj_20)
       (pred_6 obj_12 obj_01)
       (pred_6 obj_09 obj_27)
       (pred_6 obj_09 obj_02)
       (pred_6 obj_09 obj_12)
       (pred_6 obj_13 obj_18)
       (pred_6 obj_13 obj_29)
       (pred_6 obj_13 obj_17)
       (pred_6 obj_29 obj_22)
       (pred_6 obj_29 obj_31)
       (pred_6 obj_29 obj_19)
       (pred_6 obj_29 obj_13)
       (pred_6 obj_31 obj_15)
       (pred_6 obj_31 obj_25)
       (pred_6 obj_31 obj_01)
       (pred_6 obj_31 obj_29)
       (pred_6 obj_25 obj_21)
       (pred_6 obj_25 obj_27)
       (pred_6 obj_25 obj_12)
       (pred_6 obj_25 obj_31)
       (pred_6 obj_27 obj_08)
       (pred_6 obj_27 obj_09)
       (pred_6 obj_27 obj_25)
       (pred_6 obj_18 obj_22)
       (pred_6 obj_18 obj_13)
       (pred_6 obj_22 obj_15)
       (pred_6 obj_22 obj_29)
       (pred_6 obj_22 obj_18)
       (pred_6 obj_15 obj_21)
       (pred_6 obj_15 obj_31)
       (pred_6 obj_15 obj_22)
       (pred_6 obj_21 obj_08)
       (pred_6 obj_21 obj_25)
       (pred_6 obj_21 obj_15)
       (pred_6 obj_08 obj_27)
       (pred_6 obj_08 obj_21)
       (pred_4 obj_06)
       (pred_4 obj_13)
       (pred_4 obj_08)
       (pred_1  obj_06 obj_07)
       (pred_1  obj_13 obj_16)
       (pred_1  obj_08 obj_10)
       (pred_12 obj_04)
       (pred_12 obj_23)
       (pred_12 obj_28)
       (pred_12 obj_24)
       (pred_12 obj_05)
       (pred_12 obj_30)
       (pred_12 obj_14)
       (pred_12 obj_20)
       (pred_12 obj_02)
       (pred_12 obj_17)
       (pred_12 obj_19)
       (pred_12 obj_01)
       (pred_12 obj_12)
       (pred_12 obj_09)
       (pred_12 obj_29)
       (pred_12 obj_31)
       (pred_12 obj_25)
       (pred_12 obj_27)
       (pred_12 obj_18)
       (pred_12 obj_22)
       (pred_12 obj_15)
       (pred_12 obj_21)

       (pred_10  obj_26 obj_07)
       (pred_10  obj_03 obj_16)
       (pred_10  obj_11 obj_10)
       (pred_11 obj_26 obj_20)
       (pred_11 obj_03 obj_22)
       (pred_11 obj_11 obj_22)
       (pred_8 obj_24)
    )

    (:goal (and
       (pred_11 obj_26 obj_04)
       (pred_11 obj_11 obj_31)
    ))
(:constraints
  (always (not (pred_8 obj_29)))
)
)

; plan
1. (op_4 obj_24 obj_02)
   deleted: (pred_8 obj_24)
   added: (pred_8 obj_02)
   goals met: 0 of 2
2. (op_4 obj_02 obj_20)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_20)
   goals met: 0 of 2
3. (op_2 obj_20 obj_26)
   deleted: (pred_11 obj_26 obj_20) (pred_2)
   added: (pred_9 obj_26)
   goals met: 0 of 2
4. (op_4 obj_20 obj_14)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_14)
   goals met: 0 of 2
5. (op_4 obj_14 obj_01)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_01)
   goals met: 0 of 2
6. (op_4 obj_01 obj_31)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_31)
   goals met: 0 of 2
7. (op_4 obj_31 obj_15)
   deleted: (pred_8 obj_31)
   added: (pred_8 obj_15)
   goals met: 0 of 2
8. (op_4 obj_15 obj_22)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_22)
   goals met: 0 of 2
9. (op_1 obj_22 obj_11 obj_26)
   deleted: (pred_9 obj_26) (pred_11 obj_11 obj_22)
   added: (pred_9 obj_11) (pred_11 obj_26 obj_22)
   goals met: 0 of 2
10. (op_4 obj_22 obj_15)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_15)
   goals met: 0 of 2
11. (op_4 obj_15 obj_31)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_31)
   goals met: 0 of 2
12. (op_3 obj_31 obj_11)
   deleted: (pred_9 obj_11)
   added: (pred_2) (pred_11 obj_11 obj_31)
   goals met: 1 of 2
13. (op_4 obj_31 obj_15)
   deleted: (pred_8 obj_31)
   added: (pred_8 obj_15)
   goals met: 1 of 2
14. (op_4 obj_15 obj_22)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_22)
   goals met: 1 of 2
15. (op_2 obj_22 obj_26)
   deleted: (pred_11 obj_26 obj_22) (pred_2)
   added: (pred_9 obj_26)
   goals met: 1 of 2
16. (op_4 obj_22 obj_15)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_15)
   goals met: 1 of 2
17. (op_4 obj_15 obj_31)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_31)
   goals met: 1 of 2
18. (op_4 obj_31 obj_01)
   deleted: (pred_8 obj_31)
   added: (pred_8 obj_01)
   goals met: 1 of 2
19. (op_4 obj_01 obj_14)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_14)
   goals met: 1 of 2
20. (op_4 obj_14 obj_28)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_28)
   goals met: 1 of 2
21. (op_4 obj_28 obj_23)
   deleted: (pred_8 obj_28)
   added: (pred_8 obj_23)
   goals met: 1 of 2
22. (op_4 obj_23 obj_04)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_04)
   goals met: 1 of 2
23. (op_3 obj_04 obj_26)
   deleted: (pred_9 obj_26)
   added: (pred_2) (pred_11 obj_26 obj_04)
   goals met: 2 of 2
